examples/fixed_grid_backend_spike/openfoam/porous_force_3d_fd_base/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1.0 -0.8 -0.6)
    ( 2.0 -0.8 -0.6)
    ( 2.0  0.8 -0.6)
    (-1.0  0.8 -0.6)
    (-1.0 -0.8  0.6)
    ( 2.0 -0.8  0.6)
    ( 2.0  0.8  0.6)
    (-1.0  0.8  0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 16 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    spanMin
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    spanMax
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    lower
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    upper
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
