examples/fixed_grid_backend_spike/openfoam/porous_force_3d_fd_base/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    spanMin
    {
        type            symmetryPlane;
    }
    spanMax
    {
        type            symmetryPlane;
    }
    lower
    {
        type            symmetryPlane;
    }
    upper
    {
        type            symmetryPlane;
    }
}
