examples/fixed_grid_backend_spike/openfoam/porous_force_3d_fd_base/0.orig/Ua
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ua;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            adjointInletVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            adjointOutletVelocity;
        value           uniform (0 0 0);
    }
    spanMin
    {
        type            symmetryPlane;
    }
    spanMax
    {
        type            symmetryPlane;
    }
    lower
    {
        type            symmetryPlane;
    }
    upper
    {
        type            symmetryPlane;
    }
}
