examples/fixed_grid_backend_spike/openfoam/porous_force_3d_fd_base/0.orig/alpha
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    spanMin
    {
        type            symmetryPlane;
    }
    spanMax
    {
        type            symmetryPlane;
    }
    lower
    {
        type            symmetryPlane;
    }
    upper
    {
        type            symmetryPlane;
    }
}
