examples/fixed_grid_backend_spike/openfoam/porous_force_3d_fd_base/system/optimisationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      optimisationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

optimisationManager steadyOptimisation;

primalSolvers
{
    op1
    {
        active                 true;
        type                   incompressible;
        solver                 simple;
        solutionControls
        {
            nIters 1000;
            residualControl
            {
                "p.*"       5.e-7;
                "U.*"       5.e-7;
            }
        }
    }
}

adjointManagers
{
    adjManager1
    {
        primalSolver             op1;
        adjointSolvers
        {
            as1
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;
                // manage objectives
                //------------------
                objectives
                {
                    type  incompressible;
                    objectiveNames
                    {
                        drag
                        {
                            weight          1.;
                            type            porousDirectionalForce;
                            direction       (1 0 0);
                            Aref            0.64;
                            UInf            1;
                        }
                    }
                }
                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel        standard;
                    extraConvection 1;
                }
                // solution control
                //------------------
                solutionControls
                {
                    nIters 4000;
                    residualControl
                    {
                        "pa.*"       5.e-7;
                        "Ua.*"       5.e-7;
                    }
                }
            }
            downforce
            {
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;
                isConstraint           true;
                objectives
                {
                    type  incompressible;
                    objectiveNames
                    {
                        downforce
                        {
                            weight          1.;
                            type            porousDirectionalForce;
                            direction       (0 0 -1);
                            Aref            0.64;
                            UInf            1;
                            target          0;
                        }
                    }
                }
                ATCModel
                {
                    ATCModel        standard;
                    extraConvection 1;
                }
                solutionControls
                {
                    nIters 4000;
                    residualControl
                    {
                        "pa.*"       5.e-7;
                        "Ua.*"       5.e-7;
                    }
                }
            }
            vol
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   null;
                isConstraint           true;
                // manage objectives
                //------------------
                objectives
                {
                    type  geometric;
                    objectiveNames
                    {
                        vol
                        {
                            weight          1.; 
                            type            topOVolume;
                            percentage      0.462;
                        }
                    }
                }
            }
        }
    }
}

optimisation
{
    designVariables
    {
        type topO;
        sensitivityType topO;
        writeFieldSens true;
        writeAllFields true;
        fixedZeroPorousZones
        (
            inletBuffer
            outletBuffer
            spanMinBuffer
            spanMaxBuffer
            lowerBuffer
            upperBuffer
        );
        regularisation
        {
            regularise     true;
            growFromWalls  false;
            meanRadiusMult 1.5;
            function       linear;
            b              20;
        }
        betaMax    2500;
        maxInitChange 0.2;
    }
    updateMethod
    {
        method ISQP;
        preconditioner ShermanMorrison;
        includeExtraVars true;
        c 2;
    }
}

// ************************************************************************* //
