examples/fixed_grid_backend_spike/openfoam/porous_force_3d_fd_base/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha 0
);

regions
(
    cellToCell
    {
        set initialPlate;
        fieldValues
        (
            volScalarFieldValue alpha 0.5
        );
    }
);
